/*
 Navicat Premium Data Transfer

 Source Server         : zhu
 Source Server Type    : MySQL
 Source Server Version : 50553
 Source Host           : localhost:3306
 Source Schema         : pig

 Target Server Type    : MySQL
 Target Server Version : 50553
 File Encoding         : 65001

 Date: 20/06/2019 23:12:43
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for bill
-- ----------------------------
DROP TABLE IF EXISTS `bill`;
CREATE TABLE `bill`  (
  `id` int(64) NOT NULL AUTO_INCREMENT COMMENT '主键id',
  `company` varchar(150) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL COMMENT '所属公司',
  `person` varchar(150) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL COMMENT '经手人',
  `buyer` varchar(150) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL COMMENT '买主',
  `bus_number` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL COMMENT '车牌号',
  `time` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL COMMENT '日期',
  `type` varchar(2) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL COMMENT '0: 进油 1：出油',
  `money_type` varchar(2) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NULL DEFAULT NULL COMMENT '0:结算 1：未结算',
  `money` double(150, 0) NULL DEFAULT NULL COMMENT '金额',
  `ah` double(150, 0) NULL DEFAULT NULL COMMENT '容量',
  `unit_price` double(150, 2) NULL DEFAULT NULL COMMENT '单价',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 119 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_bin ROW_FORMAT = Compact;

-- ----------------------------
-- Records of bill
-- ----------------------------
INSERT INTO `bill` VALUES (8, '明常市政', '朱传录', '盛大虎', '株友船挖', '2019-06-13', '1', '1', 18427, 2792, 6.60);
INSERT INTO `bill` VALUES (9, '明常市政', '朱传录', '盛大虎', '株友船挖', '2019-06-13', '1', '1', 3094, 495, 6.25);
INSERT INTO `bill` VALUES (10, '明常市政', '朱传录', '杜红海', '株友挖机', '2019-06-13', '1', '1', 25285, 3831, 6.60);
INSERT INTO `bill` VALUES (11, '明常市政', '朱传录', '杜红海', '株友挖机', '2019-06-13', '1', '1', 1756, 281, 6.25);
INSERT INTO `bill` VALUES (12, '明常市政', '朱传录', '李顺', '神刚4号', '2019-06-13', '1', '1', 8764, 1328, 6.60);
INSERT INTO `bill` VALUES (13, '明常市政', '朱传录', '李顺', '神刚4号', '2019-06-13', '1', '1', 1719, 275, 6.25);
INSERT INTO `bill` VALUES (14, '明常市政', '朱传录', '陈帆', '徐工船挖13号', '2019-06-11', '1', '1', 17100, 2591, 6.60);
INSERT INTO `bill` VALUES (15, '明常市政', '朱传录', '田超', '加腾3号', '2019-06-11', '1', '1', 8521, 1291, 6.60);
INSERT INTO `bill` VALUES (16, '明常市政', '朱传录', '王耀兵', '小松挖机', '2019-06-13', '1', '1', 23852, 3614, 6.60);
INSERT INTO `bill` VALUES (17, '明常市政', '朱传录', '王耀兵', '小松挖机', '2019-06-13', '1', '1', 1794, 287, 6.25);
INSERT INTO `bill` VALUES (18, '明常市政', '朱传录', '魏小波', 'JCM船挖', '2019-06-13', '1', '1', 22427, 3398, 6.60);
INSERT INTO `bill` VALUES (19, '明常市政', '朱传录', '魏小波', 'JCM船挖', '2019-06-13', '1', '1', 1981, 317, 6.25);
INSERT INTO `bill` VALUES (20, '明常市政', '朱传录', '王建', '徐工船挖', '2019-06-13', '1', '1', 12619, 1912, 6.60);
INSERT INTO `bill` VALUES (21, '明常市政', '朱传录', '王建', '徐工船挖', '2019-06-13', '1', '1', 4025, 644, 6.25);
INSERT INTO `bill` VALUES (22, '明常市政', '朱传录', '付斌', '斗三船挖', '2019-06-13', '1', '1', 7524, 1140, 6.60);
INSERT INTO `bill` VALUES (23, '明常市政', '朱传录', '付斌', '斗三船挖', '2019-06-13', '1', '1', 2737, 438, 6.25);
INSERT INTO `bill` VALUES (24, '明常市政', '朱传录', '陈文安', '神刚1号', '2019-06-16', '1', '1', 20229, 3065, 6.60);
INSERT INTO `bill` VALUES (25, '明常市政', '朱传录', '陈文安', '神刚1号', '2019-06-16', '1', '1', 3287, 526, 6.25);
INSERT INTO `bill` VALUES (26, '明常市政', '朱传录', '彭为红', '斗三船挖7号', '2019-06-16', '1', '1', 11299, 1712, 6.60);
INSERT INTO `bill` VALUES (27, '明常市政', '朱传录', '彭为红', '斗三船挖7号', '2019-06-16', '1', '1', 3425, 548, 6.25);
INSERT INTO `bill` VALUES (28, '明常市政', '朱传录', '袁志伟', '奇瑞挖机', '2019-06-11', '1', '1', 11009, 1668, 6.60);
INSERT INTO `bill` VALUES (29, '明常市政', '朱传录', '吴俊', '加腾2号', '2019-06-09', '1', '1', 17774, 2693, 6.60);
INSERT INTO `bill` VALUES (30, '明常市政', '朱传录', '应勇', '加腾1号', '2019-06-13', '1', '1', 19562, 2964, 6.60);
INSERT INTO `bill` VALUES (31, '明常市政', '朱传录', '应勇', '加腾1号', '2019-06-13', '1', '1', 1594, 255, 6.25);
INSERT INTO `bill` VALUES (32, '明常市政', '朱传录', '石强', '日立2号', '2019-06-11', '1', '1', 33568, 5086, 6.60);
INSERT INTO `bill` VALUES (33, '明常市政', '朱传录', '李仁红', '徐工船挖29号', '2019-06-11', '1', '1', 7365, 1116, 6.60);
INSERT INTO `bill` VALUES (34, '明常市政', '朱传录', '梁杰', '神刚3号', '2019-06-11', '1', '1', 11873, 1799, 6.60);
INSERT INTO `bill` VALUES (35, '明常市政', '朱传录', '戴俊', '三一挖机', '2019-06-11', '1', '1', 27172, 4117, 6.60);
INSERT INTO `bill` VALUES (36, '明常市政', '朱传录', '方润波', '日立1号', '2019-06-11', '1', '1', 32241, 4885, 6.60);
INSERT INTO `bill` VALUES (37, '明常市政', '朱传录', '袁庆', '龙吸水车', '2019-06-09', '1', '1', 97165, 14722, 6.60);
INSERT INTO `bill` VALUES (38, '明常市政', '朱传录', '周涛', '徐工船挖', '2019-06-11', '1', '1', 16071, 2435, 6.60);
INSERT INTO `bill` VALUES (39, '明常市政', '朱传录', '夏其喜', '日立3号', '2019-06-11', '1', '1', 27476, 4163, 6.60);
INSERT INTO `bill` VALUES (40, '明常市政', '朱传录', '李强', '柳工挖机', '2019-06-11', '1', '1', 34452, 5220, 6.60);
INSERT INTO `bill` VALUES (41, '明常市政', '朱传录', '王猛', '神刚2号', '2019-06-11', '1', '1', 19945, 3022, 6.60);
INSERT INTO `bill` VALUES (42, '明常市政', '朱传录', '王高成', '徐工挖机', '2019-06-11', '1', '1', 9457, 1433, 6.60);
INSERT INTO `bill` VALUES (43, '明常市政', '朱传录', '张正', '大于船挖1号', '2019-06-11', '1', '1', 16341, 2476, 6.60);
INSERT INTO `bill` VALUES (44, '明常市政', '朱传录', '鲁腾/鲍德军', '徐工船挖7号', '2019-06-11', '1', '1', 9655, 1463, 6.60);
INSERT INTO `bill` VALUES (45, '明常市政', '朱传录', '陈威', '徐工船挖2号', '2019-06-11', '1', '1', 16434, 2490, 6.60);
INSERT INTO `bill` VALUES (46, '明常市政', '朱传录', '范伟李程', '新三一船挖', '2019-06-11', '1', '1', 16771, 2541, 6.60);
INSERT INTO `bill` VALUES (47, '明常市政', '朱传录', '夏小兵', '小挖', '2019-05-13', '1', '1', 3386, 513, 6.60);
INSERT INTO `bill` VALUES (48, '明常市政', '朱传录', '张岩', '徐工船挖', '2019-06-11', '1', '1', 14975, 2269, 6.60);
INSERT INTO `bill` VALUES (49, '明常市政', '朱传录', '黄自兵', '神刚6号', '2019-06-11', '1', '1', 4455, 675, 6.60);
INSERT INTO `bill` VALUES (50, '明常市政', '朱传录', '盛晓虎', '斗三船挖14号', '2019-06-11', '1', '1', 12309, 1865, 6.60);
INSERT INTO `bill` VALUES (51, '明常市政', '朱传录', '占显峰', '神刚5号', '2019-06-11', '1', '1', 9055, 1372, 6.60);
INSERT INTO `bill` VALUES (52, '明常市政', '朱传录', '乔志刚', '三一船挖', '2019-06-11', '1', '1', 13167, 1995, 6.60);
INSERT INTO `bill` VALUES (53, '明常市政', '朱传录', '李顺', '神刚4号', '2019-06-16', '1', '1', 1037, 166, 6.25);
INSERT INTO `bill` VALUES (54, '明常市政', '朱传录', '占显峰', '神刚5号', '2019-06-13', '1', '1', 1631, 261, 6.25);
INSERT INTO `bill` VALUES (55, '明常市政', '朱传录', '盛晓虎', '斗三船挖14号', '2019-06-16', '1', '1', 1437, 230, 6.25);
INSERT INTO `bill` VALUES (56, '明常市政', '朱传录', '盛晓虎', '斗三船挖14号', '2019-06-13', '1', '1', 2025, 324, 6.25);
INSERT INTO `bill` VALUES (57, '明常市政', '朱传录', '鲁腾/鲍德军', '徐工船挖7号', '2019-06-16', '1', '1', 2075, 332, 6.25);
INSERT INTO `bill` VALUES (58, '明常市政', '朱传录', '黄神光', '徐工挖机', '2019-06-16', '1', '1', 1725, 276, 6.25);
INSERT INTO `bill` VALUES (59, '明常市政', '朱传录', '王耀兵', '小松挖机', '2019-06-16', '1', '1', 1131, 181, 6.25);
INSERT INTO `bill` VALUES (60, '明常市政', '朱传录', '胡进', '9963', '2019-06-16', '1', '1', 1125, 180, 6.25);
INSERT INTO `bill` VALUES (61, '明常市政', '朱传录', '彭加平', '981', '2019-06-16', '1', '1', 475, 76, 6.25);
INSERT INTO `bill` VALUES (62, '明常市政', '朱传录', '梁杰', '神刚3号', '2019-06-16', '1', '1', 1406, 225, 6.25);
INSERT INTO `bill` VALUES (63, '明常市政', '朱传录', '陈威', '徐工船挖2号', '2019-06-15', '1', '1', 2243, 359, 6.25);
INSERT INTO `bill` VALUES (64, '明常市政', '朱传录', '陈帆', '徐工船挖13号', '2019-06-16', '1', '1', 3437, 550, 6.25);
INSERT INTO `bill` VALUES (65, '明常市政', '朱传录', '张正', '大于船挖1号', '2019-06-16', '1', '1', 2106, 337, 6.25);
INSERT INTO `bill` VALUES (66, '明常市政', '朱传录', '石强', '日立汗挖2号', '2019-06-16', '1', '1', 1456, 233, 6.25);
INSERT INTO `bill` VALUES (67, '明常市政', '朱传录', '方润波', '日立1号', '2019-06-16', '1', '1', 1500, 240, 6.25);
INSERT INTO `bill` VALUES (68, '明常市政', '朱传录', '汪得乐', '柳工挖机', '2019-06-16', '1', '1', 1456, 233, 6.25);
INSERT INTO `bill` VALUES (69, '明常市政', '朱传录', '陈茂平', '日立3号', '2019-06-16', '1', '1', 1425, 228, 6.25);
INSERT INTO `bill` VALUES (70, '明常市政', '朱传录', '袁志伟', '奇瑞挖机', '2019-06-16', '1', '1', 1493, 239, 6.25);
INSERT INTO `bill` VALUES (71, '明常市政', '朱传录', '袁庆', '龙吸水车', '2019-06-16', '1', '1', 7375, 1180, 6.25);
INSERT INTO `bill` VALUES (72, '明常市政', '朱传录', '李仁红', '徐工船挖29号', '2019-06-16', '1', '1', 1862, 298, 6.25);
INSERT INTO `bill` VALUES (73, '明常市政', '朱传录', '魏小波', 'JCM船挖', '2019-06-16', '1', '1', 1375, 220, 6.25);
INSERT INTO `bill` VALUES (74, '明常市政', '朱传录', '乔志刚', '三一船挖', '2019-06-16', '1', '1', 2375, 380, 6.25);
INSERT INTO `bill` VALUES (75, '明常市政', '朱传录', '戴俊', '三一挖机', '2019-06-16', '1', '1', 1862, 298, 6.25);
INSERT INTO `bill` VALUES (76, '明常市政', '朱传录', '张岩', '徐工船挖', '2019-06-16', '1', '1', 3125, 500, 6.25);
INSERT INTO `bill` VALUES (77, '明常市政', '朱传录', '周涛', '徐工船挖1号', '2019-06-16', '1', '1', 2500, 400, 6.25);
INSERT INTO `bill` VALUES (78, '明常市政', '朱传录', '张岩', '徐工船挖5号', '2019-06-13', '1', '1', 4150, 664, 6.25);
INSERT INTO `bill` VALUES (79, '明常市政', '朱传录', '刘少军', '三一挖机', '2019-06-13', '1', '1', 1693, 271, 6.25);
INSERT INTO `bill` VALUES (80, '明常市政', '朱传录', '乔志刚', '三一船挖', '2019-06-13', '1', '1', 2500, 400, 6.25);
INSERT INTO `bill` VALUES (81, '明常市政', '朱传录', '汪得乐', '柳工挖机', '2019-06-13', '1', '1', 1981, 317, 6.25);
INSERT INTO `bill` VALUES (82, '明常市政', '朱传录', '陈茂平', '日立3号', '2019-06-13', '1', '1', 1725, 276, 6.25);
INSERT INTO `bill` VALUES (83, '明常市政', '朱传录', '黄神光', '徐工挖机', '2019-06-13', '1', '1', 2381, 381, 6.25);
INSERT INTO `bill` VALUES (84, '明常市政', '朱传录', '袁志伟', '奇瑞挖机', '2019-06-13', '1', '1', 1875, 300, 6.25);
INSERT INTO `bill` VALUES (85, '明常市政', '朱传录', '陈帆', '徐工船挖13号', '2019-06-13', '1', '1', 3937, 630, 6.25);
INSERT INTO `bill` VALUES (86, '明常市政', '朱传录', '方润波', '日立1号', '2019-06-13', '1', '1', 1875, 300, 6.25);
INSERT INTO `bill` VALUES (87, '明常市政', '朱传录', '占显峰', '神刚5号', '2019-06-15', '1', '1', 1293, 207, 6.25);
INSERT INTO `bill` VALUES (88, '明常市政', '朱传录', '梁杰', '神刚3号', '2019-06-13', '1', '1', 1743, 279, 6.25);
INSERT INTO `bill` VALUES (89, '明常市政', '朱传录', '袁志伟', '奇瑞挖机', '2019-06-16', '1', '1', 1500, 240, 6.25);
INSERT INTO `bill` VALUES (90, '明常市政', '朱传录', '汪得乐', '柳工挖机', '2019-06-15', '1', '1', 1625, 260, 6.25);
INSERT INTO `bill` VALUES (91, '明常市政', '朱传录', '陈茂平', '日立3号', '2019-06-15', '1', '1', 1268, 203, 6.25);
INSERT INTO `bill` VALUES (92, '明常市政', '朱传录', '石强', '日立2号', '2019-06-15', '1', '1', 1475, 236, 6.25);
INSERT INTO `bill` VALUES (93, '明常市政', '朱传录', '王建', '徐工船挖', '2019-06-15', '1', '1', 2393, 383, 6.25);
INSERT INTO `bill` VALUES (94, '明常市政', '朱传录', '彭为红', '斗三船挖7号', '2019-06-15', '1', '1', 1562, 250, 6.25);
INSERT INTO `bill` VALUES (95, '明常市政', '朱传录', '周涛', '徐工船挖1号', '2019-06-13', '1', '1', 2762, 442, 6.25);
INSERT INTO `bill` VALUES (96, '明常市政', '朱传录', '鲁腾/鲍德军', '徐工船挖', '2019-06-13', '1', '1', 1750, 280, 6.25);
INSERT INTO `bill` VALUES (97, '明常市政', '朱传录', '石强', '日立2号', '2019-06-13', '1', '1', 1937, 310, 6.25);
INSERT INTO `bill` VALUES (98, '明常市政', '朱传录', '李顺', '神刚4号', '2019-06-15', '1', '1', 1625, 260, 6.25);
INSERT INTO `bill` VALUES (99, '明常市政', '朱传录', '张正', '大于船挖1号', '2019-06-13', '1', '1', 1125, 180, 6.25);
INSERT INTO `bill` VALUES (100, '明常市政', '朱传录', '李仁红', '徐工船挖29号', '2019-06-13', '1', '1', 1812, 290, 6.25);
INSERT INTO `bill` VALUES (101, '明常市政', '朱传录', '黄自兵', '神刚6号', '2019-06-13', '1', '1', 1275, 204, 6.25);
INSERT INTO `bill` VALUES (102, '明常市政', '朱传录', '夏其喜', '小挖机', '2019-06-13', '1', '1', 600, 96, 6.25);
INSERT INTO `bill` VALUES (103, '明常市政', '朱传录', '陈威', '徐工船挖2号', '2019-06-13', '1', '1', 2162, 346, 6.25);
INSERT INTO `bill` VALUES (104, '明常市政', '朱传录', '黄神光', '徐工挖机', '2019-06-15', '1', '1', 1462, 234, 6.25);
INSERT INTO `bill` VALUES (105, '明常市政', '朱传录', '张正', '大于船挖1号', '2019-06-15', '1', '1', 1812, 290, 6.25);
INSERT INTO `bill` VALUES (106, '明常市政', '朱传录', '彭加平', '981', '2019-06-15', '1', '1', 943, 151, 6.25);
INSERT INTO `bill` VALUES (107, '明常市政', '朱传录', '鲁腾/鲍德军', '徐工船挖7号', '2019-06-15', '1', '1', 1693, 271, 6.25);
INSERT INTO `bill` VALUES (108, '明常市政', '朱传录', '梁杰', '神刚3号', '2019-06-15', '1', '1', 1462, 234, 6.25);
INSERT INTO `bill` VALUES (109, '明常市政', '朱传录', '陈威', '徐工船挖2号', '2019-06-15', '1', '1', 2062, 330, 6.25);
INSERT INTO `bill` VALUES (110, '明常市政', '朱传录', '陈帆', '徐工船挖13号', '2019-06-15', '1', '1', 1875, 300, 6.25);
INSERT INTO `bill` VALUES (111, '明常市政', '朱传录', '周涛', '徐工船挖1号', '2019-06-15', '1', '1', 2937, 470, 6.25);
INSERT INTO `bill` VALUES (112, '明常市政', '朱传录', '戴俊', '三一挖机', '2019-06-15', '1', '1', 1387, 222, 6.25);
INSERT INTO `bill` VALUES (113, '明常市政', '朱传录', '范伟', '新三一船挖', '2019-06-15', '1', '1', 4687, 750, 6.25);
INSERT INTO `bill` VALUES (114, '明常市政', '朱传录', '乔志刚', '三一船挖', '2019-06-15', '1', '1', 1875, 300, 6.25);
INSERT INTO `bill` VALUES (115, '明常市政', '朱传录', '盛晓虎', '斗三船挖14号', '2019-06-15', '1', '1', 2062, 330, 6.25);
INSERT INTO `bill` VALUES (116, '明常市政', '朱传录', '魏小波', 'JCM船挖', '2019-06-15', '1', '1', 1431, 229, 6.25);
INSERT INTO `bill` VALUES (117, '明常市政', '朱传录', '李仁红', '徐工船挖29号', '2019-06-15', '1', '1', 2500, 400, 6.25);
INSERT INTO `bill` VALUES (118, '明常市政', '朱传录', '黄自兵', '神刚6号', '2019-06-15', '1', '1', 1756, 281, 6.25);

SET FOREIGN_KEY_CHECKS = 1;
